#include "reg51.h"
#define u8 unsigned char
/*
	掌握按键的检测方法
目前效果：开机后P0=0xff，共阴极全亮，共阳极全灭
	按下按键后，等待放手，然后显示某个数字

低要求：数码管依次显示0到9，死循环。找到编码
中要求：数码管依次显示0到9，死循环
	按下按键后，等待放手，切换共阴极、共阳极模式
高要求：共阴或共阳，按下按键后，等待放手，切换++和--模式
	默认显示0到9的i++，切换后显示9到0的i--
*/	
int c=0;
sbit KEY=P2^0;//定义按键引脚是P20
u8 a[]={0xc0,0xf9,0xa4,0xb0,0x99,0x92,0x82,0xf8,0x80,0x90};
int i=0;
void delay(long i)
{
			while(i--)
				if(KEY==0)
				{
					while(KEY==0);
					c++;
				}
}

//数码管要注意消隐，否则可能混乱
void main()
{
	while(1)
	{
		
			
		if(c%2==0)//按下了
		{
			if(i>9)
				i=0;
			
			
				P0=a[i++];//显示某个数字
				delay(10000);
			
			
		
		}
	if(c%2==1)//按下了
		{
				if(i<0)
				i=9;
				P0=a[i--];//显示某个数字
				delay(10000);
			
		
		}
		
		
		
		
}
}
