#include "reg51.h"
sbit laba=P1^0;
#define u8 unsigned char//0--255
#define u16 unsigned int//0--65535

/*
单片机的信号太弱，无法驱动喇叭！但是仿真可以省略
单片机输出高电平，喇叭低电平不响；反之则响

目前效果：发出滴答的声音

低要求：门铃
中要求：救护车，或消防车，或警车的声音
高要求：播放歌曲
*/
u8 SONG_TONE[]={212,212,190,212,159,169,212,212,190,212,142,159,212,212,106,126,159,169,190,119,119,126,159,142,159,0};
u8 SONG_LONG[]={9,3,12,12,12,24,9,3,12,12,12,24,9,3,12,12,12,12,12,9,3,12,12,12,24,0};
	
void delay(long k){while(k--);}

void main()
{
    u16 i=0,j,k;//0--65535
		laba=1;
	
	
	
//	while(1)
//	{
//		   for(i=0;i<500;i++)//i<50改为200，观察效果//控制播放时间
//		   {
//		     laba=0;delay(9);//导通就响，不通就不响//控制调节声音的不同
//		     laba=1;delay(9);//
//		   }
//		   for(i=0;i<500;i++)//i<100改为250，观察效果
//		   {
//		     laba=0;delay(12);//
//		     laba=1;delay(12);//改为delay(1,100)看看
//		   }
//	}叮咚门铃	
	

	//	
//	while(1)
//	{
//		for(i = 0; i < 1200; i++)
//		{
//			for(j = 0; j < 80/2; j++); 
//			laba=!laba; 
//		}
//		for(i = 0; i < 800; i++)
//		{
//			for(j = 0; j < 100/2; j++);
//			laba=!laba; 
//		}
//	}

//	救护车
	
	
	
	
//     while(SONG_LONG[i]!=0||SONG_TONE[i]!=0)
// {   
//     for(j=0;j<SONG_LONG[i]*40;j++)  //播放各个音符，SONG_LONG 为拍子长度声音的时间长短
//   {
//        laba=!laba;
//         for(k=0;k<SONG_TONE[i]/4;k++);//SONG_TONE 延时表决定了每个音符的频率  声音的不同
//   }
//    delay(10);
//    i++;
// }	
//	生日歌
	   

	
	
}

